{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "FAssetTypeActions_FSM",
			"Children": [
				{
					"Source":
					{
						"Text": "Finite State Machine"
					},
					"Translation":
					{
						"Text": "유한 상태 머신"
					},
					"Key": "FiniteStateMachine Name"
				}
			]
		},
		{
			"Namespace": "FSMEditorModule",
			"Children": [
				{
					"Source":
					{
						"Text": "FiniteStateMachine"
					},
					"Translation":
					{
						"Text": "유한 상태 머신"
					},
					"Key": "FSMCategory"
				}
			]
		},
		{
			"Namespace": "FSMSSchema",
			"Children": [
				{
					"Source":
					{
						"Text": "A new state"
					},
					"Translation":
					{
						"Text": "새로운 상태"
					},
					"Key": "AddStateTooltip"
				},
				{
					"Source":
					{
						"Text": "Add Node"
					},
					"Translation":
					{
						"Text": "노드 추가"
					},
					"Key": "K2_AddFSMNode"
				},
				{
					"Source":
					{
						"Text": "Add State"
					},
					"Translation":
					{
						"Text": "상태 추가"
					},
					"Key": "AddState"
				},
				{
					"Source":
					{
						"Text": "Both are on the same node"
					},
					"Translation":
					{
						"Text": "둘 다 동일한 노드에 있습니다"
					},
					"Key": "Conect Node are same"
				},
				{
					"Source":
					{
						"Text": "Change Link"
					},
					"Translation":
					{
						"Text": "링크 변경"
					},
					"Key": "Change Link"
				},
				{
					"Source":
					{
						"Text": "Conect Node Invalid"
					},
					"Translation":
					{
						"Text": "연결 노드 유효하지 않음"
					},
					"Key": "Conect Node Invalid"
				},
				{
					"Source":
					{
						"Text": "Create a transition"
					},
					"Translation":
					{
						"Text": "전환 만들기"
					},
					"Key": "Create a transition"
				},
				{
					"Source":
					{
						"Text": "Entry must connect to a state node"
					},
					"Translation":
					{
						"Text": "항목은 상태 노드에 연결해야 합니다"
					},
					"Key": "Entry must connect to a state node"
				},
				{
					"Source":
					{
						"Text": "Finite State Machine"
					},
					"Translation":
					{
						"Text": "유한 상태 머신"
					},
					"Key": "State Category"
				},
				{
					"Source":
					{
						"Text": "Never Connect to Entry"
					},
					"Translation":
					{
						"Text": "엔트리에 연결하지 않기"
					},
					"Key": "Never Connect to Entry"
				},
				{
					"Source":
					{
						"Text": "Nodes Is Already Connected"
					},
					"Translation":
					{
						"Text": "노드가 이미 연결됨"
					},
					"Key": "Nodes Is Already Connected"
				}
			]
		},
		{
			"Namespace": "UFSMStateGraphSchema",
			"Children": [
				{
					"Source":
					{
						"Text": "[{StateNodeTitle}]"
					},
					"Translation":
					{
						"Text": "[{StateNodeTitle}]"
					},
					"Key": "FSMStateGraphTitle"
				}
			]
		},
		{
			"Namespace": "UFSMTransitionGraphSchema",
			"Children": [
				{
					"Source":
					{
						"Text": "{TransNodeTitle}"
					},
					"Translation":
					{
						"Text": "{TransNodeTitle}"
					},
					"Key": "TransitionGraphTitle"
				}
			]
		},
		{
			"Namespace": "UFSMTransitionNode",
			"Children": [
				{
					"Source":
					{
						"Text": "(null)"
					},
					"Translation":
					{
						"Text": "(null)"
					},
					"Key": "Null"
				},
				{
					"Source":
					{
						"Text": "Trans {BoundGraph}}"
					},
					"Translation":
					{
						"Text": "Trans {BoundGraph}}"
					},
					"Key": "TransitioNState"
				},
				{
					"Source":
					{
						"Text": "[{PrevState}]->[{NextState}]"
					},
					"Translation":
					{
						"Text": "[{PrevState}]->[{NextState}]"
					},
					"Key": "FSMPrevStateToNewState"
				}
			]
		},
		{
			"Namespace": "UFSMTransitionResultNode",
			"Children": [
				{
					"Source":
					{
						"Text": "TransitionResult"
					},
					"Translation":
					{
						"Text": "트랜지션 결과"
					},
					"Key": "TransitionResultNodeName"
				}
			]
		}
	]
}